# ООП (объектно-ориентированное программирование) - это подход к созданию 
# программного обеспечения на основе объектов.

# Основные составляющие ООП :
# 1) Инкапсуляция - свойство объекта скрывать критически-важные места.

# 2) Наследование - свойство объектов передавать информацию о себе всем последующим объектам.
# Причем базовый объект (имеющий информацию) - родительский.
# Принимающий информацию - дочерний.

# 3) Полиморфизм - свойство объектов, вести себя по-разному в зависимости от окружения
